select Н_ЛЮДИ.ИД, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ОТЧЕСТВО, Н_ОТДЕЛЫ.КОРОТКОЕ_ИМЯ ОТДЕЛ
from (
    (select ИД from Н_ЛЮДИ) except (select ЧЛВК_ИД from Н_УЧЕНИКИ) --  не студенты
    union (
            select max(Н_УЧЕНИКИ.ЧЛВК_ИД) ЧЛВК_ИД
            from Н_УЧЕНИКИ
            join Н_ПЛАНЫ on Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
            join Н_ОТДЕЛЫ on Н_ПЛАНЫ.ОТД_ИД = Н_ОТДЕЛЫ.ИД

            where (
                Н_ОТДЕЛЫ.КОРОТКОЕ_ИМЯ != 'СПбГУИТМО'
            )
            group by Н_УЧЕНИКИ.ЧЛВК_ИД
    ) --  студенты, но не итмо
) НЕ_ИТМО
join Н_ЛЮДИ on НЕ_ИТМО.ИД = Н_ЛЮДИ.ИД
join Н_УЧЕНИКИ on НЕ_ИТМО.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
join Н_ПЛАНЫ on Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
join Н_ОТДЕЛЫ on Н_ПЛАНЫ.ОТД_ИД = Н_ОТДЕЛЫ.ИД
order by Н_ОТДЕЛЫ.КОРОТКОЕ_ИМЯ asc;
